"""Single Responsibility Principle"""
""""Класс должен иметь только одну причину для изменения, то есть он должен выполнять лишь одну функцию."""
"""
Упражнение заключается в следующем:

Создание модели студента:

Студент имеет имя и оценку.
Реализация через data-класс.
Создание класса репозитория студентов:

Хранение списка студентов.
Методы для добавления нового студента и получения списка всех студентов.
Создание класса для статистики студентов:

Метод для расчета средней оценки.
Метод для нахождения студента с наилучшей оценкой.
Взаимодействие с репозиторием для получения данных.
Создание класса для печати отчета:

Генерация отчета с информацией о студенте, среднем балле и лучшем студенте.
Вывод всех студентов и их оценок.
Практическая реализация:

Создание экземпляров каждого из классов.
Добавление нескольких студентов в репозиторий.
Печать отчета с помощью созданного метода.
"""



